app/Services/ProjectRepository.php

INSERT INTO `projects` (`name`, `slug`, `template`, `uuid`, `published`, `updated_at`, `id`, `created_at`) VALUES ('Test project 2', 'test_project 2', , 'ESO2THaLCxiNojShC83fiKfaoJ9wqvCoxgYK', 0, '2023-03-06 17:15:57', '989fd847-ac92-4fbb-bdd0-8004e5b3ebd1', '2023-03-06 17:15:57')
SELECT * FROM `projects` WHERE `id` = '989fd847-ac92-4fbb-bdd0-8004e5b3ebd1' LIMIT 1
---
    public function create(array $data): Project
    {
        $project = $this->project
            ->create([
                'name' => $data['name'],
                'user_id' => $data['userId'] ?? Auth::user()->id,
                'template' => Arr::get($data, 'template_name'),
                'published' => $data['published'] ?? false,
                'updated_at' => $data['updated_at'] ?? now(),
            ])
            ->fresh();
        $project->users()->attach($data['userId'] ?? Auth::user()->id);

        $projectPath = $this->getProjectPath($project);

        $this->addBootstrapFiles($projectPath);

        //thumbnail
        $this->storage->put(
            "$projectPath/thumbnail.png",
            Storage::disk('builder')->get(TemplateLoader::DEFAULT_THUMBNAIL),
        );