app/Http/Controllers/Api/AuthController.php

SELECT * FROM `roles` WHERE `name` = 'user' LIMIT 1
SELECT * FROM `users` WHERE `email` = 'benny@gmail.com' LIMIT 1
---
    public function register(Request $request)
    {
        $request->validate([
            // 'username' => 'required|max:50|min:3|unique:users',
            'first_name' => 'required|max:50|min:3',
            'last_name' => 'required|max:50|min:3',
            'phone' => 'required|min:3|unique:users',
            'email' => 'required|max:50|email|unique:users',
            'password'  => 'required|min:6',
            'repeat_password' => 'required|same:password',
        ]);

        $data = $request->all();
        $role = Role::where('name', 'user')->first();
        $data['password'] = bcrypt($data['password']);
        $user = User::create($data);

        $user->attachRole($role);
        // login user
        try {

            return $this->successResponse('Login successful!', [
                'user' =>  new UserCollection(User::where('email', $user->email)->first()),
                'token' => $user->createToken($request->email)->plainTextToken
            ]);

SELECT * FROM `users` WHERE `email` = 'benny@gmail.com' LIMIT 1
---
    public function login(Request $request): JsonResponse
    {
        $validator = Validator::make($request->all(), [
            'email' => 'required|max:50|email|exists:users',
            'password'  => 'required|min:6'
        ], [
            'exists' => 'This email does not exist.',
        ]);

        if ($validator->fails()) {
            return response()->json(['error' => $validator->errors()->first()], 422);
        }
        // assuming that the email or username is passed through a 'login' parameter
        $login = $request->input('email');
        $field = filter_var($login, FILTER_VALIDATE_EMAIL) ? 'email' : 'phone';
        $request->merge([$field => $login]);
        $credentials = $request->only($field, 'password');

        try {

            if(Auth::attempt(['email' => $request->email, 'password' => $request->password])){
                $user = User::where('email', $request->email)->first();

                $data['user'] = new UserCollection(User::where('email', $request->email)->first());